#include <stdio.h>
#include <locale.h>
int main()

{
	setlocale(LC_ALL, "Rus");
	printf("123\n"); // подзадание 1
	printf("1\n2\n3\n"); // подзадание 2
	printf("1\n\t2\n\t\t3\n"); // подзадание 3
	printf("%1d\n %2d\n %3d\n %4d\n ", 1, 2, 3, 4); // подзадание 4
	printf("%10.3f\n ", 12.234657);  // подзадание 5
	printf("%6.5f\n ", 12.234657);  // подзадание 6
	printf("Остаток от деления %d на %d равен %d\n ", 5, 2, 5 % 2);  // подзадание 7
	printf("Остаток от деления %d на %d равен %d\n ", 7, 5, 7 % 5);  // подзадание 8
	printf("Произведение %d на %d равно %d\n ", 2000, 4, 2000 * 4);  // подзадание 9
	printf("%g разделить %e равно %f\n ", 5., 2000000., 5. / 2000000); // 10
	printf("%d разделить %d равно %d\n ", 5., 2000000., 5. / 2000000);
	printf("%1.0f разделить %7.0f равно %f\n ", 5., 2000000., 5. / 2000000);
	printf("%g разделить %g равно %g\n ", 5., 2000000., 5. / 2000000);
}